## データフレームに天気データを追加

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from pathlib import Path

/Users/yuki/.pyenv/versions/3.7.3/lib/python3.7/site-packages/pandas/compat/__init__.py:85: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)
/Users/yuki/.pyenv/versions/3.7.3/lib/python3.7/site-packages/pandas/compat/__init__.py:85: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
df = pd.read_csv("dr_record.csv", index_col=0)

In [3]:
print(df["start_time"].dtype)

object

In [4]:
df["start_time"] = pd.to_datetime(df["start_time"])

In [5]:
df.head()

,dr_num,start_time,finish_time,lat1,lon1,lat2,lon2,dis
0,167007,2016-04-01 08:23:23,2016-04-01 08:57:08,35.725998,139.822224,35.689216,139.745462,11955.232742
1,167007,2016-04-01 09:10:41,2016-04-01 09:21:07,35.691702,139.741012,35.701415,139.756430,2232.459013
2,167007,2016-04-01 09:22:57,2016-04-01 09:33:31,35.701405,139.755431,35.710814,139.773949,3438.608272
3,167007,2016-04-01 09:35:47,2016-04-01 09:40:54,35.712424,139.778178,35.707448,139.793827,1669.184583
4,167007,2016-04-01 09:55:37,2016-04-01 10:15:51,35.697036,139.786218,35.669411,139.741313,5657.205801

In [6]:
print(df["start_time"][0].date())

2016-04-01

In [7]:
def map_date(start_time):
    date = start_time.date()
    return date

In [8]:
df["date"] = df["start_time"]
df.head()

,dr_num,start_time,finish_time,lat1,lon1,lat2,lon2,dis,date
0,167007,2016-04-01 08:23:23,2016-04-01 08:57:08,35.725998,139.822224,35.689216,139.745462,11955.232742,2016-04-01 08:23:23
1,167007,2016-04-01 09:10:41,2016-04-01 09:21:07,35.691702,139.741012,35.701415,139.756430,2232.459013,2016-04-01 09:10:41
2,167007,2016-04-01 09:22:57,2016-04-01 09:33:31,35.701405,139.755431,35.710814,139.773949,3438.608272,2016-04-01 09:22:57
3,167007,2016-04-01 09:35:47,2016-04-01 09:40:54,35.712424,139.778178,35.707448,139.793827,1669.184583,2016-04-01 09:35:47
4,167007,2016-04-01 09:55:37,2016-04-01 10:15:51,35.697036,139.786218,35.669411,139.741313,5657.205801,2016-04-01 09:55:37

In [9]:
df['date'] = df['date'].map(map_date)

In [10]:
df["date"] = pd.to_datetime(df["date"])

In [11]:
print(df["date"].dtype)

datetime64[ns]

In [12]:
df.head()

,dr_num,start_time,finish_time,lat1,lon1,lat2,lon2,dis,date
0,167007,2016-04-01 08:23:23,2016-04-01 08:57:08,35.725998,139.822224,35.689216,139.745462,11955.232742,2016-04-01
1,167007,2016-04-01 09:10:41,2016-04-01 09:21:07,35.691702,139.741012,35.701415,139.756430,2232.459013,2016-04-01
2,167007,2016-04-01 09:22:57,2016-04-01 09:33:31,35.701405,139.755431,35.710814,139.773949,3438.608272,2016-04-01
3,167007,2016-04-01 09:35:47,2016-04-01 09:40:54,35.712424,139.778178,35.707448,139.793827,1669.184583,2016-04-01
4,167007,2016-04-01 09:55:37,2016-04-01 10:15:51,35.697036,139.786218,35.669411,139.741313,5657.205801,2016-04-01

In [13]:
df_c = pd.read_csv("climate_t.csv")

In [14]:
df_c.head()

       date  temperature  rain
0  2016/4/1         12.8   2.5
1  2016/4/2         10.5   1.5
2  2016/4/3         13.1   4.0
3  2016/4/4         15.6   8.0
4  2016/4/5         10.8   1.5

In [15]:
df_c["date"] = pd.to_datetime(df_c["date"])
print(df_c["date"].dtype)

datetime64[ns]

In [16]:
df_m = pd.merge(df, df_c, on = "date", how='left')
df_m.head()

,dr_num,start_time,finish_time,lat1,lon1,lat2,lon2,dis,date,temperature,rain
0,167007,2016-04-01 08:23:23,2016-04-01 08:57:08,35.725998,139.822224,35.689216,139.745462,11955.232742,2016-04-01,12.8,2.5
1,167007,2016-04-01 09:10:41,2016-04-01 09:21:07,35.691702,139.741012,35.701415,139.756430,2232.459013,2016-04-01,12.8,2.5
2,167007,2016-04-01 09:22:57,2016-04-01 09:33:31,35.701405,139.755431,35.710814,139.773949,3438.608272,2016-04-01,12.8,2.5
3,167007,2016-04-01 09:35:47,2016-04-01 09:40:54,35.712424,139.778178,35.707448,139.793827,1669.184583,2016-04-01,12.8,2.5
4,167007,2016-04-01 09:55:37,2016-04-01 10:15:51,35.697036,139.786218,35.669411,139.741313,5657.205801,2016-04-01,12.8,2.5

In [17]:
df_m.to_csv("dr_cli.csv")